---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IndexStreamPoint Properties
IndexStreamPoint Class See Also Send Feedback
---

The IndexStreamPoint type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from IndexStream.) |

# See Also

IndexStreamPoint Class

Autodesk.Revit.DB.DirectContext3D Namespace